###################################################################

# Created by write_sdc on Sat Oct  1 18:36:14 2022

###################################################################
set sdc_version 2.0

set_units -time ns
set_load -pin_load 2 [get_ports input_serial_rsc_rdy]
set_load -pin_load 2 [get_ports weight_serial_rsc_rdy]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(15)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(14)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(13)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(12)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(11)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(10)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(9)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(8)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(7)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(6)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(5)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(4)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(3)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(2)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(1)]
set_load -pin_load 2 [get_ports output_serial_rsc_dat(0)]
set_load -pin_load 2 [get_ports output_serial_rsc_vld]
set_load -pin_load 2 [get_ports paramsIn_rsc_rdy]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_clock_uncertainty 0  [get_clocks clk]
create_clock -name virtual_io_clk  -period 5  -waveform {0 2.5}
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(7)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(6)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(5)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(4)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(3)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(2)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(1)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_dat(0)]
set_input_delay -clock clk  0  [get_ports input_serial_rsc_vld]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(7)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(6)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(5)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(4)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(3)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(2)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(1)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_dat(0)]
set_input_delay -clock clk  0  [get_ports weight_serial_rsc_vld]
set_input_delay -clock clk  0  [get_ports output_serial_rsc_rdy]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(15)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(14)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(13)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(12)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(11)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(10)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(9)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(8)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(7)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(6)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(5)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(4)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(3)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(2)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(1)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_dat(0)]
set_input_delay -clock clk  0  [get_ports paramsIn_rsc_vld]
set_output_delay -clock clk  0  [get_ports input_serial_rsc_rdy]
set_output_delay -clock clk  0  [get_ports weight_serial_rsc_rdy]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(15)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(14)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(13)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(12)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(11)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(10)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(9)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(8)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(7)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(6)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(5)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(4)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(3)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(2)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(1)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_dat(0)]
set_output_delay -clock clk  0  [get_ports output_serial_rsc_vld]
set_output_delay -clock clk  0  [get_ports paramsIn_rsc_rdy]
