ncsim(64): 15.20-s022: (c) Copyright 1995-2017 Cadence Design Systems, Inc.

The SystemC(r) Code included in this Product is Copyright  1996 - 2016 by all Contributors.  All rights reserved.

The SystemC Code included in this Product has been modified by Cadence Design Systems, Inc. and CoWare, Inc. All such modifications are Copyright (c) 2004-2016 Cadence Design Systems, Inc. and Copyright (c) 2004 CoWare, Inc.  All Rights Reserved.

SystemC(r) is a registered trademark of Accellera Systems Initiative, Inc. in the United States and other countries and is used with permission.


Info: CCS_CLK_CTOR: Clock 'clk' - Using default clock period '5 ns'
Disabling STALL_FLAG toggling

-------------------------------------
Relinquished control to SimVision...
ncsim> # Source static function file
ncsim> global env
ncsim> # Source the common TCL file (that also reads the wave database file)
ncsim> source $env(MGC_HOME)/pkgs/sif/userware/En_na/flows/ncsim_funcs.tcl
ncsim> read_ccs_wave ./build/Conv.v1/scverify/ccs_wave_signals.dat
Reading SCVerify waveform database './build/Conv.v1/scverify/ccs_wave_signals.dat'
ncsim> setup_vcd_file ./build/Conv.v1/.dut_inst_info.tcl
ncsim> 
ncsim> populate_wave_window
Populating WAVE window...
ncsim> 
ncsim> if { ("0" != {}) && [file exists "0"] } {
>    source "0"
> }
ncsim> # If not running in GUI mode, run the entire simulation
ncsim> if { ![gui_is_active] } {
>    do_simulation_run
> }
ncsim> 
ncsim> database -open waves -into waves.shm -default
Created default SHM database waves
ncsim> probe -create -shm scverify_top.rtl.clk scverify_top.rst scverify_top.user_tb.cpp_testbench_active scverify_top.rtl.arst_n scverify_top.rtl.paramsIn_rsc_rdy scverify_top.rtl.paramsIn_rsc_vld scverify_top.rtl.paramsIn_rsc_dat scverify_top.rtl.output_serial_rsc_rdy scverify_top.rtl.output_serial_rsc_vld scverify_top.rtl.output_serial_rsc_dat scverify_top.rtl.input_serial_rsc_rdy scverify_top.rtl.input_serial_rsc_vld scverify_top.rtl.input_serial_rsc_dat scverify_top.rtl.weight_serial_rsc_rdy scverify_top.rtl.weight_serial_rsc_vld scverify_top.rtl.weight_serial_rsc_dat scverify_top.user_tb.output_serial_comp._compare_cnt_sig scverify_top.user_tb.output_serial_comp._golden_sig scverify_top.user_tb.output_serial_comp._dut_sig scverify_top.user_tb.output_serial_comp._error_cnt_sig scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriter.InputDoubleBufferWriter_4096_16_16_run_inst.InputDoubleBufferWriter_4096_16_16_run_staller_inst.run_wen scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferReader.InputDoubleBufferReader_4096_16_16_run_inst.InputDoubleBufferReader_4096_16_16_run_staller_inst.run_wen scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.InputDoubleBuffer_4096_16_16_run_inst.InputDoubleBuffer_4096_16_16_run_run_inst.InputDoubleBuffer_4096_16_16_run_run_staller_inst.run_wen scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriter.WeightDoubleBufferWriter_4096_16_16_run_inst.WeightDoubleBufferWriter_4096_16_16_run_staller_inst.run_wen scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReader.WeightDoubleBufferReader_4096_16_16_run_inst.WeightDoubleBufferReader_4096_16_16_run_staller_inst.run_wen scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.WeightDoubleBuffer_4096_16_16_run_inst.WeightDoubleBuffer_4096_16_16_run_run_inst.WeightDoubleBuffer_4096_16_16_run_run_staller_inst.run_wen scverify_top.rtl.systolicArray.systolicArrayCore.SystolicArrayCore_IDTYPE_WDTYPE_ODTYPE_16_16_struct_inst.SystolicArrayCore_IDTYPE_WDTYPE_ODTYPE_16_16_run_inst.SystolicArrayCore_IDTYPE_WDTYPE_ODTYPE_16_16_run_staller_inst.run_wen scverify_top.rtl.paramsDeserializer_1.ParamsDeserializer_run_inst.ParamsDeserializer_run_staller_inst.run_wen scverify_top.rtl.outputSerializer.Serializer_PackedInt_16UL_16UL_ODTYPE_16_run_inst.Serializer_PackedInt_16UL_16UL_ODTYPE_16_run_staller_inst.run_wen scverify_top.rtl.systolicArray.systolicArrayLooper_1.SystolicArrayLooper_run_inst.SystolicArrayLooper_run_staller_inst.run_wen scverify_top.deadlocked scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.FIFO.count scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.FIFO.peak scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.write_stall scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.read_stall scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.din_vld scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.din_rdy scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.din scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.dout_vld scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.dout_rdy scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.dout scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.sz scverify_top.rtl.inputDoubleBuffer.InputDoubleBuffer_4096_16_16_struct_inst.inputDoubleBufferWriterParams_cns_pipe.sz_req scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.FIFO.count scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.FIFO.peak scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.write_stall scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.read_stall scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.din_vld scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.din_rdy scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.din scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.dout_vld scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.dout_rdy scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.dout scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.sz scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferWriterParams_cns_pipe.sz_req scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.FIFO.count scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.FIFO.peak scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.write_stall scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.read_stall scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.din_vld scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.din_rdy scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.din scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.dout_vld scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.dout_rdy scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.dout scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.sz scverify_top.rtl.weightDoubleBuffer.WeightDoubleBuffer_4096_16_16_struct_inst.weightDoubleBufferReaderParams_cns_pipe.sz_req scverify_top.rtl.inputDoubleBufferParams_cns_pipe.FIFO.count scverify_top.rtl.inputDoubleBufferParams_cns_pipe.FIFO.peak scverify_top.rtl.inputDoubleBufferParams_cns_pipe.write_stall scverify_top.rtl.inputDoubleBufferParams_cns_pipe.read_stall scverify_top.rtl.inputDoubleBufferParams_cns_pipe.din_vld scverify_top.rtl.inputDoubleBufferParams_cns_pipe.din_rdy scverify_top.rtl.inputDoubleBufferParams_cns_pipe.din scverify_top.rtl.inputDoubleBufferParams_cns_pipe.dout_vld scverify_top.rtl.inputDoubleBufferParams_cns_pipe.dout_rdy scverify_top.rtl.inputDoubleBufferParams_cns_pipe.dout scverify_top.rtl.inputDoubleBufferParams_cns_pipe.sz scverify_top.rtl.inputDoubleBufferParams_cns_pipe.sz_req scverify_top.rtl.weightDoubleBufferParams_cns_pipe.FIFO.count scverify_top.rtl.weightDoubleBufferParams_cns_pipe.FIFO.peak scverify_top.rtl.weightDoubleBufferParams_cns_pipe.write_stall scverify_top.rtl.weightDoubleBufferParams_cns_pipe.read_stall scverify_top.rtl.weightDoubleBufferParams_cns_pipe.din_vld scverify_top.rtl.weightDoubleBufferParams_cns_pipe.din_rdy scverify_top.rtl.weightDoubleBufferParams_cns_pipe.din scverify_top.rtl.weightDoubleBufferParams_cns_pipe.dout_vld scverify_top.rtl.weightDoubleBufferParams_cns_pipe.dout_rdy scverify_top.rtl.weightDoubleBufferParams_cns_pipe.dout scverify_top.rtl.weightDoubleBufferParams_cns_pipe.sz scverify_top.rtl.weightDoubleBufferParams_cns_pipe.sz_req scverify_top.rtl.systolicArrayParams_cns_pipe.FIFO.count scverify_top.rtl.systolicArrayParams_cns_pipe.FIFO.peak scverify_top.rtl.systolicArrayParams_cns_pipe.write_stall scverify_top.rtl.systolicArrayParams_cns_pipe.read_stall scverify_top.rtl.systolicArrayParams_cns_pipe.din_vld scverify_top.rtl.systolicArrayParams_cns_pipe.din_rdy scverify_top.rtl.systolicArrayParams_cns_pipe.din scverify_top.rtl.systolicArrayParams_cns_pipe.dout_vld scverify_top.rtl.systolicArrayParams_cns_pipe.dout_rdy scverify_top.rtl.systolicArrayParams_cns_pipe.dout scverify_top.rtl.systolicArrayParams_cns_pipe.sz scverify_top.rtl.systolicArrayParams_cns_pipe.sz_req scverify_top.rtl.output_cns_pipe.FIFO.count scverify_top.rtl.output_cns_pipe.FIFO.peak scverify_top.rtl.output_cns_pipe.write_stall scverify_top.rtl.output_cns_pipe.read_stall scverify_top.rtl.output_cns_pipe.din_vld scverify_top.rtl.output_cns_pipe.din_rdy scverify_top.rtl.output_cns_pipe.din scverify_top.rtl.output_cns_pipe.dout_vld scverify_top.rtl.output_cns_pipe.dout_rdy scverify_top.rtl.output_cns_pipe.dout scverify_top.rtl.output_cns_pipe.sz scverify_top.rtl.output_cns_pipe.sz_req scverify_top.rtl.input_out_cns_pipe.FIFO.count scverify_top.rtl.input_out_cns_pipe.FIFO.peak scverify_top.rtl.input_out_cns_pipe.write_stall scverify_top.rtl.input_out_cns_pipe.read_stall scverify_top.rtl.input_out_cns_pipe.din_vld scverify_top.rtl.input_out_cns_pipe.din_rdy scverify_top.rtl.input_out_cns_pipe.din scverify_top.rtl.input_out_cns_pipe.dout_vld scverify_top.rtl.input_out_cns_pipe.dout_rdy scverify_top.rtl.input_out_cns_pipe.dout scverify_top.rtl.input_out_cns_pipe.sz scverify_top.rtl.input_out_cns_pipe.sz_req scverify_top.rtl.weight_out_cns_pipe.FIFO.count scverify_top.rtl.weight_out_cns_pipe.FIFO.peak scverify_top.rtl.weight_out_cns_pipe.write_stall scverify_top.rtl.weight_out_cns_pipe.read_stall scverify_top.rtl.weight_out_cns_pipe.din_vld scverify_top.rtl.weight_out_cns_pipe.din_rdy scverify_top.rtl.weight_out_cns_pipe.din scverify_top.rtl.weight_out_cns_pipe.dout_vld scverify_top.rtl.weight_out_cns_pipe.dout_rdy scverify_top.rtl.weight_out_cns_pipe.dout scverify_top.rtl.weight_out_cns_pipe.sz scverify_top.rtl.weight_out_cns_pipe.sz_req scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.FIFO.count scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.FIFO.peak scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.write_stall scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.read_stall scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.din_vld scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.din_rdy scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.din scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.dout_vld scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.dout_rdy scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.dout scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.sz scverify_top.rtl.systolicArray.paramsChannel_cns_pipe.sz_req scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.FIFO.count scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.FIFO.peak scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.write_stall scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.read_stall scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.din_vld scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.din_rdy scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.din scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.dout_vld scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.dout_rdy scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.dout scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.sz scverify_top.rtl.systolicArray.loopIndicesChannel_cns_pipe.sz_req
Created probe 1
ncsim> run
SCVerify intercepting C++ function 'Conv::run' for RTL block 'Conv'

Info: HW reset: TLS_arst_n active @ 0 s
Assert in file /cad/mentor/2019.11/Catapult_Synthesis_10.4b-841621/Mgc_home/shared/include/ac_channel.h:248 Read from empty channel
ncsim: *E,SCABRT: Signal SIGABRT raised outside of simulator.
